CSI API ETABS v1

# cSapModelFrameObj Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cFrameObj FrameObj { get; }

    ReadOnly Property FrameObj As cFrameObj
    	Get

    Dim instance As cSapModel
    Dim value As cFrameObj

    value = instance.FrameObj

    property cFrameObj^ FrameObj {
    	cFrameObj^ get ();
    }

    abstract FrameObj : cFrameObj with get

#### Property Value

Type: cFrameObj

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com